[
    {
        "datetime": "12h",
        "headline": "Starbucks Manager Quits Over Woke Culture That Led to Bullying",
        "source": "CNBC",
        "url": "https://cloud.iexapis.com/v1/news/article/eZuY5JU0cFmBDwSqx9J7nThDEtFg9THJFbKc3HAQAHn",
        "summary": "Amanda Wannagat was an exemplary Starbucks store manager. She repeatedly received accolades from the global coffee shop chain for her performance. New store managers would get sent to her store in Salt Lake City to learn how to do the job properly. Despite solid career prospects and reasonable pay that supported her three children, this []",
        "related": "SBUX",
        "image": "https://cloud.iexapis.com/v1/news/image/eZuY5JU0cFmBDwSqx9J7nThDEtFg9THJFbKc3HAQAHn",
        "lang": "en",
        "hasPaywall": false
    },
    {
        "datetime": "1h",
        "headline": "Tesla will open its Superchargers to other EVs this year: Musk",
        "source": "Benzinga",
        "url": "https://cloud.iexapis.com/v1/news/article/3PJftHyCWzN5tXEyH5SvK1ofgH4qmdWnX2SbYETVfwah",
        "summary": "San Francisco, July 21 (IANS) Tesla CEO Elon Musk has confirmed that the company is opening up its Supercharger network to other EVs later this year. According to Musk, Tesla has created its own connector, as there was no standard back then and Tesla was the only maker of long-range electric cars. \"It''s one fairly slim connector for both low and high power charging,\" Musk wrote on Twitter. \"That said, we''re making our Supercharger network open to other EVs later this year,\" he added. As of May, Tesla''s Supercharger network has reached a total of 25,000 chargers -- a big milestone for the fast-charging network. At the end of 2020, Tesla had over 20,000 charging stalls at over 2,100 Supercharging stations around the world. Engadget reports that opening up its network to other companies won''t be simple, seeing as Tesla uses a proprietary connector in North America. It has to make sure the stations will work across brands and that a secure software handshake between a non-Tesla car and a Supercharger is possible, the report said.",
        "related": "TSLA",
        "image": "https://cloud.iexapis.com/v1/news/image/3PJftHyCWzN5tXEyH5SvK1ofgH4qmdWnX2SbYETVfwah",
        "lang": "en",
        "hasPaywall": false
    },
    {
        "datetime": "2h",
        "headline": "iPhone Supplier Foxconn Says China Floods Not Impacting Operations",
        "source": "Benzinga",
        "url": "https://cloud.iexapis.com/v1/news/article/2FP6ayE12kIVUMdEvVdHUWRIJ7CawJxYAsBSNHSITY3S",
        "summary": "Apple supplier Foxconn, which is Apple''s largest and most important supplier for the iPhone , has said that torrential floods that have hit the Henan province in China, where it houses its main iPhone production plant, have not been impacted operations. Photo credit to China News Service (via Focus Taiwan ) In a statement to CNBC , Foxconn says that its main factory in Zhengzhou, the capital of the Henan province, had not been impacted by major flooding in the city, which has taken the lives of twelve people, according to local reports. Foxconn says that it had \"activated an emergency response plan for flood control measures in that location\" and is actively monitoring the situation. We can confirm that there has been no direct impact on our facility in that location to date, and we are closely monitoring the situation and will provide any updates as appropriate. The heavy rainfall which has so far displaced over 100,000 residents of the province is expected to continue until Wednesday evening.",
        "related": "AAPL",
        "image": "https://cloud.iexapis.com/v1/news/image/2FP6ayE12kIVUMdEvVdHUWRIJ7CawJxYAsBSNHSITY3S",
        "lang": "en",
        "hasPaywall": false
    },
    {
        "datetime": "4h",
        "headline": "Air Taxi Market Trends, Growth Forecast and Industry statistics till 2027 | EHANG, Volocopter GmbH, Uber Technologies, FAAC AG, Ehang, Kitty Hawk, and Lilium",
        "source": "Reuters",
        "url": "https://cloud.iexapis.com/v1/news/article/3HwQpGSfg6iIMgbTCP1mIGTYCfnwsrgFPqurqFBhUb51",
        "summary": "The Air Taxi market size is estimated to grow from USD 820 Million in 2019 to USD XX Million by 2027, growing at a CAGR of 26.2% during the forecast year from 2021 to 2027 The Air Taxi market study analyzes the market",
        "related": "UBER",
        "image": "https://cloud.iexapis.com/v1/news/image/3HwQpGSfg6iIMgbTCP1mIGTYCfnwsrgFPqurqFBhUb51",
        "lang": "en",
        "hasPaywall": false
    },
    {
        "datetime": "4h",
        "headline": "AMC, GameStop and retail traders changing the game, as short sellers continue getting burned",
        "source": "Bloomberg",
        "url": "https://cloud.iexapis.com/v1/news/article/3T0KQ4vBBixqgwoFINwHgp2ewiMxFo7iiAqq4tSx0L7H",
        "summary": "There''s a growing trend of meme stock retail traders using apps like Robinhood to buy and trade stocks instantly. They are typically younger traders who buy and trade stocks based on behaviors and emotion rather than traditionally gauging a companys performance and potential future earnings.",
        "related": "GME",
        "image": "https://cloud.iexapis.com/v1/news/image/3T0KQ4vBBixqgwoFINwHgp2ewiMxFo7iiAqq4tSx0L7H",
        "lang": "en",
        "hasPaywall": false
    },
    {
        "datetime": "7h",
        "headline": "US allies accuse Beijing of major Microsoft cyber attack",
        "source": "Bloomberg",
        "url": "https://cloud.iexapis.com/v1/news/article/3zcLH3MI7ZA2t5ELAkpkxF9Y0UNzWymLJ7rpRseWandV",
        "summary": "America, Australia, the European Union, United Kingdom, North Atlantic Treaty Organization, and other countries publicly criticized the Chinese Communist Party (CCP). U.S. allies joined in blaming the CCP for orchestrating a major cyberattack on Microsoft and other breaches. [Chinas] Ministry of State Security (MSS) has fostered an ecosystem of criminal contract hackers who carry out []",
        "related": "MSFT",
        "image": "https://cloud.iexapis.com/v1/news/image/3zcLH3MI7ZA2t5ELAkpkxF9Y0UNzWymLJ7rpRseWandV",
        "lang": "en",
        "hasPaywall": false
    },
    {
        "datetime": "10h",
        "headline": "NVIDIA Unveils TensorRT8 to Accelerate AI Inferencing",
        "source": "MarketWatch",
        "url": "https://cloud.iexapis.com/v1/news/article/VqBNvov44Ba7SFGN9s2RVfUb9kwSRvykosHhScbMnFe",
        "summary": "On July 20, NVIDIA launched TensorRT 8, a software development kit (SDK) designed to help companies build smarter, more interactive language apps from cloud to edge. The latest version of the SDK is available for free to members of NVIDIAs developer program. Plug-ins, parsers, and samples are also available to developers from the TensorRT GitHub [] The post NVIDIA Unveils TensorRT8 to Accelerate AI Inferencing appeared first on eWEEK .",
        "related": "NVDA",
        "image": "https://cloud.iexapis.com/v1/news/image/VqBNvov44Ba7SFGN9s2RVfUb9kwSRvykosHhScbMnFe",
        "lang": "en",
        "hasPaywall": false
    },
    {
        "datetime": "11h",
        "headline": "AMDs Radeon RX 6600 and RX 6600 XT reportedly launching on August 11 with improved availability",
        "source": "Bloomberg",
        "url": "https://cloud.iexapis.com/v1/news/article/ciR4PDIuYzHr0HXdddNIcTYI5AHmdfjkeaNE9zbSaKH",
        "summary": "SimpleNews AMDs Radeon RX 6600 and RX 6600 XT reportedly launching on August 11 with improved availability Rumor mill: Given the slew of leaks and listings surrounding AMDs Radeon RX 6600 XT and RX 6600 over the last few weeks, all signs point to an imminent launch. Now, a new report claims to have an exact date: August 11. It also states that there will be plenty of the cards in stock, [] The post AMDs Radeon RX 6600 and RX 6600 XT reportedly launching on August 11 with improved availability appeared first on SimpleNews .",
        "related": "AMD",
        "image": "https://cloud.iexapis.com/v1/news/image/ciR4PDIuYzHr0HXdddNIcTYI5AHmdfjkeaNE9zbSaKH",
        "lang": "en",
        "hasPaywall": false
    },
    {
        "datetime": "14h",
        "headline": "Visa, lender partner for facial recognition payment solution",
        "source": "Benzinga",
        "url": "https://cloud.iexapis.com/v1/news/article/3CLnTDfq4HkfkcKIq9GRmUQEaQcEGZpvzhKTUQqSWCZy",
        "summary": "VTB Bank, a Russian bank, has partnered with Visa to launch a facial recognition payment solution. According to a press release, Vision, a contactless technology provider, is offering its O.Vision facial recognition app, which customers can link to their payment cards for contactless purchases. The statement said that the companies are currently piloting the service []",
        "related": "V",
        "image": "https://cloud.iexapis.com/v1/news/image/2evvXgxWx7faR4JSUQ6hYZ09wYn8IH85Wa8HoFyqFQLJ",
        "lang": "en",
        "hasPaywall": false
    }
]